ЗаявкаДеск/src/Enums/РолиПользователя/РолиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователя</name>
  <enumValues>
    <name>Заявитель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
</mdclass:Enum>

ЗаявкаДеск/src/Enums/ПриоритетыЗаявок/ПриоритетыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПриоритетыЗаявок</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
</mdclass:Enum>

ЗаявкаДеск/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Решена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

ЗаявкаДеск/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ЗаявкаДеск/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>TelegramID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЗаявкаДеск/src/HTTPServices/HTTPСервис/Module.bsl
Функция ПользовательПолучитьПользователя(Запрос)
	
	Попытка
        ИД = Запрос.ПараметрыURL["telegram_id"];

        ЗапросБД = Новый Запрос;
        ЗапросБД.Текст = "ВЫБРАТЬ
        |   Пользователи.TelegramID КАК TelegramID,
        |   Пользователи.Имя КАК Имя,
        |   Пользователи.Роль КАК Роль,
        |   Пользователи.Активен КАК Активен
        |ИЗ
        |   Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |   Пользователи.TelegramID = &TelegramID";

        ЗапросБД.УстановитьПараметр("TelegramID", ИД); // ← обязательно!

        Выборка = ЗапросБД.Выполнить().Выбрать();

        Если НЕ Выборка.Следующий() Тогда // ← один пользователь или никого
            Возврат ОтветОшибки(404, "not_found", "Пользователь не найден");
        КонецЕсли;

        Данные = Новый Структура;
        Данные.Вставить("telegram_id", Выборка.TelegramID);
        Данные.Вставить("name", Выборка.Имя);
        Данные.Вставить("role", Строка(Выборка.Роль)); // ← Строка() обязательно
        Данные.Вставить("active", Выборка.Активен);

        Ответ = Новый HTTPСервисОтвет(200);
        Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
        Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные)); // ← Данные, не Список
        Возврат Ответ;

    Исключение
        Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
    КонецПопытки;
		
КонецФункции

Функция РегистрацияПользователейЗарегистрироватьПользователя(Запрос)
	
	Попытка
        // 1. Читаем тело
        ЧтениеJSON = Новый ЧтениеJSON;
        ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
        Тело = ПрочитатьJSON(ЧтениеJSON);

        // 2. Достаём поля — ключи должны совпадать с тем что шлёт Python
        ТелеграмИД = Тело["telegram_id"];
        Имя        = Тело["имя"];

        // 3. Ищем пользователя
        ЗапросБД = Новый Запрос;
        ЗапросБД.Текст = "ВЫБРАТЬ
        |   Пользователи.TelegramID КАК TelegramID,
        |   Пользователи.Имя КАК Имя,
        |   Пользователи.Роль КАК Роль,
        |   Пользователи.Активен КАК Активен
        |ИЗ
        |   Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |   Пользователи.TelegramID = &TelegramID";
        ЗапросБД.УстановитьПараметр("TelegramID", ТелеграмИД);

        Выборка = ЗапросБД.Выполнить().Выбрать();

        Если Выборка.Следующий() Тогда
            // 4. Нашли → возвращаем 200
            Данные = Новый Структура;
            Данные.Вставить("telegram_id", Выборка.TelegramID);
            Данные.Вставить("name",        Выборка.Имя);
            Данные.Вставить("role",        Строка(Выборка.Роль));
            Данные.Вставить("active",      Выборка.Активен);

            Ответ = Новый HTTPСервисОтвет(200);
            Ответ.Заголовки.Вставить("Content-Type", "application/json, charset=utf-8");
            Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
            Возврат Ответ;

        Иначе
            // 5. Не нашли → создаём нового
            НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
            НовыйПользователь.TelegramID = ТелеграмИД;
            НовыйПользователь.Имя        = Имя;
            НовыйПользователь.Роль       = Перечисления.РолиПользователя.Заявитель;
            НовыйПользователь.Активен    = Истина;
            НовыйПользователь.Записать();

            Данные = Новый Структура;
            Данные.Вставить("telegram_id", НовыйПользователь.TelegramID);
            Данные.Вставить("name",        НовыйПользователь.Имя);
            Данные.Вставить("role",        Строка(НовыйПользователь.Роль));
            Данные.Вставить("active",      НовыйПользователь.Активен);

            Ответ = Новый HTTPСервисОтвет(201);
            Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
            Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
            Возврат Ответ;

        КонецЕсли;

    Исключение
        Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
    КонецПопытки;
		
	
КонецФункции

Функция СправочникиПолучитьСправочники(Запрос)
	
	Попытка
		Данные = Новый Структура;
		Данные.Вставить("statuses", ЗначенияПеречисления("СтатусыЗаявок"));
		Данные.Вставить("priorities", ЗначенияПеречисления("ПриоритетыЗаявок"));
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		
		Возврат Ответ;
		
	Исключение
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;	
		
	
КонецФункции

Функция ЗначенияПеречисления(ИмяПеречисления)
	
	Список = Новый Массив;
	МетаданныеПеречисления = Метаданные.Перечисления[ИмяПеречисления];
	Для КАждого Значение Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
		Список.Добавить(Значение.Имя);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

Функция КатегорииПолучитьКатегории(Запрос)
	
	Попытка
		
		ЗапросБД = Новый Запрос;
		ЗапросБД.Текст = "ВЫБРАТЬ
		|	Категории.Код КАК Код,
		|	Категории.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Категории КАК Категории";
		
		Результат = ЗапросБД.Выполнить();
		Выборка = Результат.Выбрать();
		Список = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			Элемент = Новый Структура;
			Элемент.Вставить("id", Выборка.Код);
			Элемент.Вставить("name", Выборка.Наименование);
			Список.Добавить(Элемент);
		КонецЦикла;		
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Список));
		Возврат Ответ;
		
	Исключение
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
		
КонецФункции

Функция ВСтрокуJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ОтветОшибки(КодHTTP, КодОшибки, Сообщение)
	Данные = Новый Структура;
	Данные.Вставить("error", КодОшибки);
	Данные.Вставить("message", Сообщение);
	
	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
	Возврат Ответ;
		
КонецФункции

Функция ЗаявкиСоздатьЗаявку(Запрос)

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
		Тело = ПрочитатьJSON(ЧтениеJSON);
		
		ТелеграмИД = Тело["telegram_id"];
		Описание = Тело["описание"];
		Категория = Тело["категория"];
		Приоритет = Тело["приоритет"];
		
		ЗапросИД = Новый Запрос;
		ЗапросИД.Текст = "ВЫБРАТЬ
		                 |	Пользователи.TelegramID КАК TelegramID,
		                 |	Пользователи.Имя КАК Имя,
		                 |	Пользователи.Ссылка КАК Ссылка
		                 |ИЗ
		                 |	Справочник.Пользователи КАК Пользователи
		                 |ГДЕ
		                 |	Пользователи.TelegramID = &TelegramID";
		
		ЗапросИД.УстановитьПараметр("TelegramID", ТелеграмИД);

	    Выборка = ЗапросИД.Выполнить().Выбрать();
		
		Если НЕ Выборка.Следующий()Тогда 
			Возврат ОтветОшибки(404, "not_Found", "Пользователь не найден");
		КонецЕсли;
		
		Заявитель = Выборка.Ссылка;
		
		ЗапросКатегории = Новый Запрос;
		ЗапросКатегории.Текст = "ВЫБРАТЬ
		                        |	Категории.Ссылка КАК Ссылка
		                        |ИЗ
		                        |	Справочник.Категории КАК Категории
		                        |ГДЕ
		                        |	Категории.Наименование = &Наименование";
		
		ЗапросКатегории.УстановитьПараметр("Наименование", Категория);
		
		ВыборкаКатегории = ЗапросКатегории.Выполнить().Выбрать();
		
		Если НЕ ВыборкаКатегории.Следующий() Тогда
			Возврат ОтветОшибки(404, "not_found", "Категория не найдена");
		КонецЕсли;
		
		КатегорияСсылка = ВыборкаКатегории.Ссылка; 
		
		ПриоритетЗначение = Перечисления.ПриоритетыЗаявок[Приоритет];
		
		Если Приоритет = "Критический" Тогда
		    ЧасовНаРешение = 4;
		ИначеЕсли Приоритет = "Высокий" Тогда
		    ЧасовНаРешение = 8;
		ИначеЕсли Приоритет = "Средний" Тогда
		    ЧасовНаРешение = 24;
		Иначе
		    ЧасовНаРешение = 72;
		КонецЕсли;

		СрокРешения = ТекущаяДата() + (ЧасовНаРешение * 3600);
		
		НоваяЗаявка = Документы.Заявка.СоздатьДокумент();
		НоваяЗаявка.Заявитель    = Заявитель;
		НоваяЗаявка.Категория    = КатегорияСсылка;
		НоваяЗаявка.Приоритет    = ПриоритетЗначение;
		НоваяЗаявка.ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая;
		НоваяЗаявка.Описание      = Описание;
		НоваяЗаявка.СрокРешения   = СрокРешения;
		НоваяЗаявка.Дата          = ТекущаяДата();

		НоваяЗаявка.Записать();

		// Формируем ответ
		Данные = Новый Структура;
		Данные.Вставить("id", Строка(НоваяЗаявка.Ссылка.УникальныйИдентификатор()));
		Данные.Вставить("номер",         НоваяЗаявка.Номер);
		Данные.Вставить("статус",        Строка(НоваяЗаявка.ТекущийСтатус));
		Данные.Вставить("срок_решения",  НоваяЗаявка.СрокРешения);

		Ответ = Новый HTTPСервисОтвет(201);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
		
		
	Исключение
    	Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
	
	
КонецФункции

Функция ЗаявкаПолучитьЗаявку(Запрос)

	Попытка
		Ид = Запрос.ПараметрыURL["id"];
		
		УИД = Новый УникальныйИдентификатор(ИД);
		СсылкаНаЗаявку = Документы.Заявка.ПолучитьСсылку(УИД);
		СсылкаНаДокумент = СсылкаНаЗаявку.ПолучитьОбъект();
		
		Если СсылкаНаДокумент = Неопределено Тогда
			Возврат ОтветОшибки(404, "not_found", "Заявка не найдена");
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("id", Строка(СсылкаНаДокумент.Ссылка.УникальныйИдентификатор()));
		Данные.Вставить("номер", СсылкаНаДокумент.Номер);
		Данные.Вставить("статус", Строка(СсылкаНаДокумент.ТекущийСтатус));
		Данные.Вставить("приоритет", Строка(СсылкаНаДокумент.Приоритет));
		Данные.Вставить("заявитель", СсылкаНаДокумент.Заявитель.Имя);
		Данные.Вставить("исполнитель", СсылкаНаДокумент.Исполнитель.Имя);
		Данные.Вставить("срок_решения", Строка(СсылкаНаДокумент.СрокРешения));
		Данные.Вставить("история", Новый Массив);
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
		
		
	Исключение
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
		
КонецФункции

Функция ЗаявкиПользователяПолучитьЗаявки(Запрос)
	
	Попытка
		// Шаг 1 — читаем query-параметры из URL
		ТелеграмИДЗаявителя = Запрос.ПараметрыЗапроса.Получить("user");
		СтатусФильтр        = Запрос.ПараметрыЗапроса.Получить("status");

		// Шаг 2 — находим заявителя по telegram_id
		ЗапросПользователя = Новый Запрос;
		ЗапросПользователя.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.TelegramID = &TelegramID";
		ЗапросПользователя.УстановитьПараметр("TelegramID", ТелеграмИДЗаявителя);

		ВыборкаПользователя = ЗапросПользователя.Выполнить().Выбрать();

		Если НЕ ВыборкаПользователя.Следующий() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пользователь не найден");
		КонецЕсли;

		Заявитель = ВыборкаПользователя.Ссылка;

		// Шаг 3 — собираем текст запроса к заявкам, базовая часть
		ТекстЗапроса = "ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка,
		|	Заявка.Номер КАК Номер,
		|	Заявка.Тема КАК Тема,
		|	Заявка.ТекущийСтатус КАК ТекущийСтатус,
		|	Заявка.Приоритет КАК Приоритет,
		|	Заявка.СрокРешения КАК СрокРешения
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Заявитель = &Заявитель";

		// Шаг 4 — если статус передан, добавляем условие к тексту
		Если СтатусФильтр <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И Заявка.ТекущийСтатус = &Статус";
		КонецЕсли;

		ЗапросЗаявок = Новый Запрос;
		ЗапросЗаявок.Текст = ТекстЗапроса;
		ЗапросЗаявок.УстановитьПараметр("Заявитель", Заявитель);

		Если СтатусФильтр <> Неопределено Тогда
			ЗапросЗаявок.УстановитьПараметр("Статус", Перечисления.СтатусыЗаявок[СтатусФильтр]);
		КонецЕсли;

		// Шаг 5 — выполняем и собираем массив
		ВыборкаЗаявок = ЗапросЗаявок.Выполнить().Выбрать();
		Список = Новый Массив;

		Пока ВыборкаЗаявок.Следующий() Цикл
			Элемент = Новый Структура;
			Элемент.Вставить("id",            Строка(ВыборкаЗаявок.Ссылка.УникальныйИдентификатор()));
			Элемент.Вставить("номер",         ВыборкаЗаявок.Номер);
			Элемент.Вставить("тема",          ВыборкаЗаявок.Тема);
			Элемент.Вставить("статус",        Строка(ВыборкаЗаявок.ТекущийСтатус));
			Элемент.Вставить("приоритет",     Строка(ВыборкаЗаявок.Приоритет));
			Элемент.Вставить("срок_решения",  Строка(ВыборкаЗаявок.СрокРешения));
			Список.Добавить(Элемент);
		КонецЦикла;

		// Шаг 6 — возвращаем ответ
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Список));
		Возврат Ответ;

	Исключение
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
			
		
КонецФункции

Функция ЗаявкиПолучитьСписок(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция Заявкаassign(Запрос)
	
	Попытка 
		ИД = Запрос.ПараметрыURL["id"];

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
		Тело = ПрочитатьJSON(ЧтениеJSON);

		ИсполнительТелеграмИД = Тело["исполнитель_telegram_id"];

		УИД = Новый УникальныйИдентификатор(ИД);
		Ссылка = Документы.Заявка.ПолучитьСсылку(УИД);
		СсылкаНаЗаявку = Ссылка.ПолучитьОбъект();

		Если СсылкаНаЗаявку = Неопределено Тогда
			Возврат ОтветОшибки(404, "not_found", "Заявка не найдена");
		КонецЕсли;

		ЗапросИД = Новый Запрос;
		ЗапросИД.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.TelegramID = &TelegramID";
		ЗапросИД.УстановитьПараметр("TelegramID", ИсполнительТелеграмИД);

		Выборка = ЗапросИД.Выполнить().Выбрать();

		Если НЕ Выборка.Следующий() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пользователь не найден");
		КонецЕсли;

		СсылкаНаЗаявку.Исполнитель = Выборка.Ссылка;
		СсылкаНаЗаявку.Записать();

		Данные = Новый Структура;
		Данные.Вставить("id",          Строка(СсылкаНаЗаявку.Ссылка.УникальныйИдентификатор()));
		Данные.Вставить("номер",       СсылкаНаЗаявку.Номер);
		Данные.Вставить("статус",      Строка(СсылкаНаЗаявку.ТекущийСтатус));
		Данные.Вставить("исполнитель", СсылкаНаЗаявку.Исполнитель.Имя);

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;

	Исключение
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
		
		
		
	
КонецФункции



Функция ОжидающиеЗаявкиПолучить(Запрос)
	Попытка
		
		ЗапросИД = Новый Запрос;
		ЗапросИД.Текст = "ВЫБРАТЬ
		                 |	Заявка.Ссылка КАК Ссылка,
		                 |	Заявка.Номер КАК Номер,
		                 |	Заявка.Приоритет КАК Приоритет,
		                 |	Заявка.СрокРешения КАК СрокРешения,
		                 |	Заявка.ТекущийСтатус КАК ТекущийСтатус
		                 |ИЗ
		                 |	Документ.Заявка КАК Заявка
		                 |ГДЕ
		                 |	Заявка.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
		
		Выборка = ЗапросИД.Выполнить().Выбрать();
		
		Массив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура;
			Данные.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			Данные.Вставить("номер", Строка(Выборка.Номер));
			Данные.Вставить("приоритет", Строка(Выборка.Приоритет));
			Данные.Вставить("срок_решения", Строка(Выборка.СрокРешения));
			Данные.Вставить("статус", Строка(Выборка.ТекущийСтатус));
			Массив.Добавить(Данные);
		КонецЦикла;
		
		
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Массив));
		Возврат Ответ;
		
	Исключение
		Возврат ОтветОшибки(500,"error", ОписаниеОшибки());
	КонецПопытки;
		
КонецФункции

Функция НазначеннаяЗаявкаПолучить(Запрос)
	
	Попытка
		
		ИД = Запрос.ПараметрыURL["telegram_id"];
		
		ЗапросИД = Новый Запрос;
		ЗапросИД.Текст = "ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.TelegramID = &TelegramID";
		ЗапросИД.УстановитьПараметр("TelegramID", ИД);

		Выборка = ЗапросИД.Выполнить().Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пользователь не найден");
		КонецЕсли;
		
		
		
		ЗапросБД = Новый Запрос;
		ЗапросБД.Текст = "ВЫБРАТЬ
		                 |	Заявка.Ссылка КАК Ссылка,
		                 |	Заявка.Номер КАК Номер,
		                 |	Заявка.Приоритет КАК Приоритет,
		                 |	Заявка.ТекущийСтатус КАК ТекущийСтатус,
		                 |	Заявка.СрокРешения КАК СрокРешения
		                 |ИЗ
		                 |	Документ.Заявка КАК Заявка
						 |ГДЕ
						 |	Заявка.Исполнитель = &Исполнитель";
		
		ЗапросБД.УстановитьПараметр("Исполнитель", Выборка.Ссылка);
		
		Выборка = ЗапросБД.Выполнить().Выбрать();
		
		Массив = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			Данные = Новый Структура;
			Данные.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			Данные.Вставить("номер", Строка(Выборка.Номер));
			Данные.Вставить("приоритет", Строка(Выборка.Приоритет));
			Данные.Вставить("срок_решения", Строка(Выборка.СрокРешения));
			Данные.Вставить("статус", Строка(Выборка.ТекущийСтатус));
			Массив.Добавить(Данные);
		КонецЦикла;
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Массив));
		Возврат Ответ;
		
	Исключение
		Возврат ОтветОшибки(500,"error", ОписаниеОшибки());
	КонецПопытки;
		
		
	
КонецФункции


Функция ЗаявкаСтатус(Запрос)
	Попытка
		
		ИД = Запрос.ПараметрыURL["id"];
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
		Тело = ПрочитатьJSON(ЧтениеJSON);
		
		НовыйСтатус = Тело["новый_статус"];
		Комментарий = Тело["комментарий"];
		
		УИД = Новый УникальныйИдентификатор(ИД);
		Ссылка = Документы.Заявка.ПолучитьСсылку(УИД);
		СсылкаНаЗаявку = Ссылка.ПолучитьОбъект();
		
		Если СсылкаНаЗаявку = Неопределено Тогда
			Возврат ОтветОшибки(404, "not_found", "Заявка не найдена");
		КонецЕсли;
		
		НачатьТранзакцию();
		
		СсылкаНаЗаявку.Заблокировать();
		
		ТекущийСтатус = Строка(СсылкаНаЗаявку.ТекущийСтатус);
		
		СтатусЗаявки = Перечисления.СтатусыЗаявок[НовыйСтатус];
		
		Если ТекущийСтатус = "Новая" Тогда
			Если НЕ НовыйСтатус = "ВРаботе" И НЕ НовыйСтатус = "Отклонена" Тогда
				ОтменитьТранзакцию();
				Возврат ОтветОшибки(409,"invalid_transition","Переход запрещен")
			КонецЕсли;
			
		ИначеЕсли ТекущийСтатус = "ВРаботе" Тогда
			Если НЕ НовыйСтатус = "Решена" И Не НовыйСтатус = "Отклонена" Тогда
				ОтменитьТранзакцию();
				Возврат ОтветОшибки(409,"invalid_transition","Переход запрещен");
			КонецЕсли;
			
		ИначеЕсли ТекущийСтатус = "Решена" Тогда
			Если Не НовыйСтатус = "Закрыта" И не НовыйСтатус = "ВРаботе" Тогда
				ОтменитьТранзакцию();
				Возврат ОтветОшибки(409,"invalid_transition","Переход запрещен")
			КонецЕсли;
			
		ИначеЕсли ТекущийСтатус = "Закрыта" Или ТекущийСтатус = "Отклонена" Тогда
			ОтменитьТранзакцию();
			Возврат ОтветОшибки(409,"invalid_transition","Переход запрещен")
		КонецЕсли;
		
		СсылкаНаЗаявку.ТекущийСтатус = СтатусЗаявки;
		СсылкаНаЗаявку.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Данные = Новый Структура;
		Данные.Вставить("id",     Строка(СсылкаНаЗаявку.Ссылка.УникальныйИдентификатор()));
		Данные.Вставить("номер",  СсылкаНаЗаявку.Номер);
		Данные.Вставить("статус", Строка(СсылкаНаЗаявку.ТекущийСтатус));;
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;

	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		Возврат ОтветОшибки(500, "error", ОписаниеОшибки());
	КонецПопытки;
КонецФункции
